[{"hotel_id": "10024", "review": {"cons": [], "pros": []}}, {"hotel_id": "10031", "review": {"cons": ["The rooms are too dark (as a design concept). The hotel is not accessible to Uber cars and you have to cross the canal to get your Uber, that's a problem when it rains.", "There was a bit of road work outside but it did not interfere with hotel operations and accessibility."], "pros": ["Café American was a nice room and the food was good. Location was excellent and handy for sights. Mother's disabled bathroom was good."]}}, {"hotel_id": "10098", "review": {"cons": ["We were given a basement room down some very steep stairs so we asked for a change.  They gave us another basement room but this was near a lift so it was better.  The price of the room did not ...", "The steep stairs are not good for people with knee problems. No connection to main hotel.", "The room for 2 people was pretty small and there was no lift. Dragging luggage up narrow stairs was a bit dangerous.", "Steps going up to the lobby very steep.I had a hard time getting my suitcase up stairs.", "Our room wasn’t cleaned once during our 4 nights, we had to beg for towels. We couldn’t dry them so they were damp. The room was mouldy, the beds uncomfortable, 2 flights of very narrow steep stairs ..."], "pros": ["My mother in law stayed here and she is disabled. The wheelchair accessibility of this hotel is made by it's amazing staff, there was one lady in particular that was fantastic and helped a lot but..."]}}, {"hotel_id": "10108", "review": {"cons": [], "pros": []}}, {"hotel_id": "10118", "review": {"cons": [], "pros": []}}, {"hotel_id": "10121", "review": {"cons": [], "pros": []}}, {"hotel_id": "10160", "review": {"cons": [], "pros": []}}, {"hotel_id": "10274", "review": {"cons": ["Issues with accessibility for wheelchair user", "Room location and the view, accessibility"], "pros": []}}, {"hotel_id": "10282", "review": {"cons": [], "pros": []}}, {"hotel_id": "10340", "review": {"cons": [], "pros": ["The room had access for the disabled people."]}}, {"hotel_id": "10361", "review": {"cons": [], "pros": []}}, {"hotel_id": "10362", "review": {"cons": ["The room was narrow , no possibility to enter the bed on the right side!!!! Stairs in a narrow rooms at the first floor to noisy and i had to take the curtains close all the time, no privacy with the ...", "I got a junior suite, it had narrow steep stairs to get to it. The room was in the rooftop very well designed and spacious", "As soon as we have checked in I have realised that City View is not what I thought it should be! View of dirty balcony that is not accessible from my room and fool of cigarete  butts and other rubbish...", "Stayed in a junior suite and the layout was all wrong. The bedroom was up very steep stairs and the bathroom was therefore downstairs from the bed. this was not good during the night for getting to ..."], "pros": ["Excellent location, hotel, food and service! €955 for three nights is a little high, but it was three nights of being made to feel special! Being disabled I'm wary of trying new hotels but the ..."]}}, {"hotel_id": "10366", "review": {"cons": ["We were traveling with our 2,5 year old daughter and tried using the lift instead of the steep stairs from the street into the hotel. The lift was broken and we had to carry the stroller up and down ..."], "pros": ["The bed matresses were annoyingly hard very bad for back \r \r The hotel  cannot be reached  but using MANY STEEP stairs  .  I don t know what an disabled or pregnant or elderly  should to  with the ..."]}}, {"hotel_id": "10423", "review": {"cons": ["Bathrooms need better accessibility and safety measures for all ages: grab bars in tubs &amp; showers. Even level entrances. Perk: nightlights for low level lighting at night."], "pros": []}}, {"hotel_id": "10438", "review": {"cons": [], "pros": []}}, {"hotel_id": "10439", "review": {"cons": ["We stayed in the annex and describing the stairs as steep is an understatement. We could barely walk up the stairs without luggage, nevermind dragging suitcases up them.", "Super Steep stairs", "Steep stairs", "room in annexe noisy as had noise from streets outside all night.Stairs very steep to room.Assumed annexe would be at the back so quieter.", "If you are staying in the annex part of the hotel be warned as no lift and stairs very narrow and steep. And at the top no hand rail.", "The lift is a little slow, opted for the stairs a few times which was okay however quite steep.", "Lift out of order tv broken stairs very steep small and dangerous  staff did not care about us I have breathing  problems  and my elderly  friend has heart problems  so lift not working  was no help ...", "The stairs in the annexe are a bit narrow. Need to be careful."], "pros": []}}, {"hotel_id": "10450", "review": {"cons": [], "pros": []}}, {"hotel_id": "10491", "review": {"cons": ["Shower got the entire bathroom wet when used. No fridge. Very warm with no air conditioning. Stairs are steep, but that's expected in Amsterdam!", "Very steep narrow stairs. The wall paper in the room looked like a cat had shredded it away from the wall. There were 2 shower heads, the first a large waterfall style one on the ceiling- soaks the ...", "Lift was very slow and stairs too steep but never a problem it's a old building, for price and no food option more too self cater would have been a big plus", "Was a bit nervous on the stairs they go quite narrow on the steps , and did not find the staff on at night as friendly when we got in I asked for 2 coffee pods for the morning as we had used the 2 in ...", "Bathroom could have been cleaner. Too narrow stairs (lift is there, but it’s achingly slow).", "Slow lift, steep stairs, rooms could be cleaned better but overall good value", "the stairs are very steep and the elevator is so slow it's useless.  The staff were nice but not at all knowledgeable about the local area. There was not enough sound proofing between the rooms.", "the lift was VERY slow... they had one iron for the whole building... narrow stairs... thin walls, I could hear people having sex in the next room. I would not stay here again.", "Narrow stairs"], "pros": []}}, {"hotel_id": "10502", "review": {"cons": ["Layout of ground floor and restaurant accessibility."], "pros": []}}, {"hotel_id": "10518", "review": {"cons": [], "pros": []}}, {"hotel_id": "10527", "review": {"cons": [], "pros": []}}, {"hotel_id": "10534", "review": {"cons": [], "pros": []}}, {"hotel_id": "10542", "review": {"cons": ["Only complaint for ya was the fact there was some construction going on at the hotel which meant some of it was not accessible. We wanted to go on the swinging chairs but they weren’t available.", "Lack of accessible toilet on ground floor is very inconvenient for customers with mobility issues, the only toilet is down a flight of steep stairs."], "pros": []}}, {"hotel_id": "10550", "review": {"cons": [], "pros": []}}, {"hotel_id": "10554", "review": {"cons": [], "pros": ["We had a lovely stay, the staff pointed us in the right direction. The bus stop into the center was a short walk and the bus ride just 10mins. I was travelling with 2 disabled persons and it was just ..."]}}, {"hotel_id": "10627", "review": {"cons": [], "pros": []}}, {"hotel_id": "10643", "review": {"cons": [], "pros": []}}, {"hotel_id": "10663", "review": {"cons": ["I stayed in the Mezzanine Suite for 4 night which was a very nice room. The two issues I faced was:\r \r 1) The stairs in the room was very steep and dangerous. Going up and down was not enjoyable. Even..."], "pros": ["The staff were excellent nothing was too much for them I was put in a room with steps down to toilet I am disabled so they changed the room with no problems"]}}, {"hotel_id": "10666", "review": {"cons": [], "pros": ["Good sized room for disabled guest"]}}, {"hotel_id": "10730", "review": {"cons": ["Rooftop lounge not accessible for deluxe double room guests......bizarre"], "pros": []}}, {"hotel_id": "10761", "review": {"cons": [], "pros": []}}, {"hotel_id": "10841", "review": {"cons": [], "pros": []}}, {"hotel_id": "10918", "review": {"cons": [], "pros": ["The disabled bathroom and the friendliness of the staff."]}}, {"hotel_id": "10971", "review": {"cons": [], "pros": []}}, {"hotel_id": "11024", "review": {"cons": ["the vendor machine was locked in the common room which was not accessible at night..whats the point of having a automatic vending machine locked away with no access???"], "pros": []}}, {"hotel_id": "11112", "review": {"cons": [], "pros": []}}, {"hotel_id": "11134", "review": {"cons": [], "pros": []}}, {"hotel_id": "11318", "review": {"cons": ["No mention prior to arriving of the apartments being in a separate building a few doors away with no lift, only steep stairs, but the concierge will take up the luggage.", "Simple things it’s a ‘part time’ apartment. No washer or dryer 🤷‍♀️ In an apartment!!!! Once again a simple throw rug for cold winter nights whilst chilling out. Stairs steep but it’s a way of life in...", "We were in the top floor apartment with 2 1'2 flights of narrow curving stairs to climb plus an additional curved flight of stairs to climb inside the apartment to get to the bedroom and bath. (We..."], "pros": []}}, {"hotel_id": "11524", "review": {"cons": [], "pros": []}}, {"hotel_id": "11604", "review": {"cons": [], "pros": ["Coffee in grab and go. Excellent disabled facilities. Great arts centre next door. V cool neighbourhood."]}}, {"hotel_id": "11679", "review": {"cons": [], "pros": []}}, {"hotel_id": "16356", "review": {"cons": [], "pros": []}}, {"hotel_id": "17626", "review": {"cons": [], "pros": []}}, {"hotel_id": "18488", "review": {"cons": ["Location and accessibility to certain trams. Very poor signage for hotel on street", "The rooftopbar was not accessible due to a private party."], "pros": ["It had good access for my disabled partner and the staff were very helpful."]}}, {"hotel_id": "26263", "review": {"cons": [], "pros": []}}, {"hotel_id": "171124", "review": {"cons": [], "pros": []}}, {"hotel_id": "254187", "review": {"cons": [], "pros": []}}, {"hotel_id": "272931", "review": {"cons": [], "pros": []}}, {"hotel_id": "281369", "review": {"cons": [], "pros": ["The bed was extra comfy and the staff ever helpful. My husband is disabled and they went out of their way and over and above to accommodate us. We would certainly return."]}}, {"hotel_id": "288883", "review": {"cons": [], "pros": ["Thoughtful facilities for disabled people, friendly staff. Recommend!", "The adapted room I booked was amazing. The bathroom was the best bathroom for disabled people."]}}, {"hotel_id": "335731", "review": {"cons": [], "pros": []}}, {"hotel_id": "338622", "review": {"cons": [], "pros": []}}, {"hotel_id": "341228", "review": {"cons": [], "pros": ["Facilities for disabled room.", "Superb location near transport hub (with intercity train, metro subway, bus and tram). Convenient store Minimart below hotel. Breakfast is beyond my expectation. Toilet facilitated disabled guest."]}}, {"hotel_id": "349348", "review": {"cons": [], "pros": []}}, {"hotel_id": "372579", "review": {"cons": [], "pros": []}}, {"hotel_id": "374292", "review": {"cons": [], "pros": []}}, {"hotel_id": "379553", "review": {"cons": ["Rooms to small for the price. Accessibility within the hotel feels missing especially when you are carrying a 35 kg luggage and need to haul it up 7 or 8 stairs to get to the hotel access area. No ...", "Having to pay so much much extra for breakfast, the cramped rooms, the accessibility of our room, helpfulness (or willingness) of staff and the lack of cleanliness: towels replaced only for a thre day...", "Entrance not accessible by taxi. Arrived late after 30 hrs of plane travel it had snowed all day and we had to drag suitcases thru it. I wasn't prepared for that.", "Size of the rooms, accessibility to the basement floor was poor, especially if you're carrying heavy luggage. Tiniest room I've stayed in"], "pros": []}}, {"hotel_id": "380885", "review": {"cons": ["Staff could have been friendlier. \r Lift was broken the day we arrived but was fixed by next morning. Staff were helpful with taking bags up to our rooms. However the stairs were very steep and spiral..."], "pros": []}}, {"hotel_id": "392495", "review": {"cons": [], "pros": []}}, {"hotel_id": "397148", "review": {"cons": [], "pros": []}}, {"hotel_id": "407459", "review": {"cons": [], "pros": []}}, {"hotel_id": "438120", "review": {"cons": ["Very little to hate about this place. However the tv is programmed so it is not accessible for hdmi access"], "pros": []}}, {"hotel_id": "439570", "review": {"cons": ["53 steep stairs", "Narrow stairs and corridors", "No elevator, steep stairs. The small space at the entrance of the 4th floor with its door open towards outside makes it look a little bit dangerous.\r You can leave your baggage there before check-in (...", "Hard bed and pillows. No safe in room. Boat-like narrow stairs to rooms.", "steep stairs leading to thr 1st floor.\r There were no tea n coffee making facilities.", "Not recommended if you have mobility issues. No elevator and VERY steep stairs. Bath was clean but shower didn’t drain well. It is an older building - no air.  Friendliness and cleanliness go a long ...", "The stairs are very steep. They were renovating and a stong paint smell was evident - but dissapated the next day", "Room badly advertised arrived late at night and had to carry bags up very steep stairs to 4th floor, due to having a spinal injury my partner had to this on his own, no help from the staff, \"mini...", "They have only two rooms for more than 2 people, one downstairs and upstairs. So we got the highest one (5th floor), so we took a flight of narrow stairs to reach our room as there is no lift."], "pros": ["Not for disabled peop e"]}}, {"hotel_id": "485077", "review": {"cons": [], "pros": []}}, {"hotel_id": "539851", "review": {"cons": ["The stairs up to the apartment are rather intimidating.  Very steep and narrow steps.  Tough to carry luggage and groceries up.  Once you are used to them they seem easier, but that first time.....", "As with most Amsterdam Apartments there are steep stairs but we managed with 4 kids , 4 suitcases and 2 strollers.  So it wasn't an issue."], "pros": []}}, {"hotel_id": "542088", "review": {"cons": [], "pros": []}}, {"hotel_id": "545708", "review": {"cons": [], "pros": ["Brilliant location friendly staff brilliant facilities later ight bar and accommodation for disabled very easy to get about"]}}, {"hotel_id": "590475", "review": {"cons": ["The stairs on the frontside, SO TINY and steep!"], "pros": []}}, {"hotel_id": "591806", "review": {"cons": ["The dark room which had no closet, the self proclaimed \"art\", the inaccessibility to parts of the hotel for hotel guests including the gallery due to private showings."], "pros": []}}, {"hotel_id": "866477", "review": {"cons": [], "pros": []}}, {"hotel_id": "1004657", "review": {"cons": [], "pros": []}}, {"hotel_id": "1014256", "review": {"cons": [], "pros": []}}, {"hotel_id": "1042748", "review": {"cons": [], "pros": []}}, {"hotel_id": "1056044", "review": {"cons": [], "pros": []}}, {"hotel_id": "1095634", "review": {"cons": ["The shared bathrooms were located on the lower level, which meant we had to navigate some steep stairs to reach them. They were also quite damp'moist as the shower drain or fan didn’t do much. The...", "To get to our room we had to climb quite steep stairs. The bathroom was located downstairs however, so it was a bit of hassle. Also, the room was cleaned (but not every day) the carpet was not ..."], "pros": []}}, {"hotel_id": "1096286", "review": {"cons": [], "pros": []}}, {"hotel_id": "1123081", "review": {"cons": [], "pros": []}}, {"hotel_id": "1264718", "review": {"cons": [], "pros": []}}, {"hotel_id": "1266500", "review": {"cons": ["Wash basin did not have a stopper so one could not do any light washing in it.  Also stairs were not accessible from ground floor so one could not get daily exercise from climbing stairs."], "pros": []}}, {"hotel_id": "1297320", "review": {"cons": [], "pros": []}}, {"hotel_id": "1318504", "review": {"cons": [], "pros": []}}, {"hotel_id": "1318648", "review": {"cons": [], "pros": []}}, {"hotel_id": "1324648", "review": {"cons": [], "pros": []}}, {"hotel_id": "1358382", "review": {"cons": [], "pros": []}}, {"hotel_id": "1368153", "review": {"cons": [], "pros": []}}, {"hotel_id": "1384024", "review": {"cons": [], "pros": []}}, {"hotel_id": "1465779", "review": {"cons": [], "pros": []}}, {"hotel_id": "1466774", "review": {"cons": [], "pros": []}}, {"hotel_id": "1587453", "review": {"cons": [], "pros": []}}, {"hotel_id": "1634357", "review": {"cons": [], "pros": []}}, {"hotel_id": "1659376", "review": {"cons": [], "pros": []}}, {"hotel_id": "1670531", "review": {"cons": ["The room was not as expected. Firstly we were placed in a room with a very steep stairs and the room was over a building site. We complained about the location of the room and that it was a double ..."], "pros": []}}, {"hotel_id": "1675178", "review": {"cons": [], "pros": []}}, {"hotel_id": "1705075", "review": {"cons": [], "pros": []}}, {"hotel_id": "1707393", "review": {"cons": ["We were not huge fans of the loft style bed, although it was spacious and comfortable using the narrow stairs in the middle of the night was a bit intimidating."], "pros": []}}, {"hotel_id": "1726563", "review": {"cons": ["Entrance is not accessible by car"], "pros": []}}, {"hotel_id": "1727371", "review": {"cons": [], "pros": []}}, {"hotel_id": "1926560", "review": {"cons": ["Location. No restaurants, supermarkets etc even remotely close by which was quite inconvenient.\r \r Gym was also not accessible, which was one of our main requirements for accomodation. This was not ..."], "pros": []}}, {"hotel_id": "2029495", "review": {"cons": [], "pros": []}}, {"hotel_id": "2064275", "review": {"cons": [], "pros": []}}, {"hotel_id": "2193502", "review": {"cons": [], "pros": []}}, {"hotel_id": "2293774", "review": {"cons": [], "pros": []}}, {"hotel_id": "2570375", "review": {"cons": [], "pros": []}}, {"hotel_id": "2593669", "review": {"cons": [], "pros": []}}, {"hotel_id": "2657700", "review": {"cons": ["The room was on the 4th floor, but the elevator only got up to the 3rd floor - we had to take the steep and winding stairs one floor up, which was difficult with a baby stroller. While booking the ..."], "pros": []}}, {"hotel_id": "2686120", "review": {"cons": [], "pros": []}}, {"hotel_id": "2700927", "review": {"cons": ["Stairs are steep so may want to take the lift."], "pros": []}}, {"hotel_id": "2742213", "review": {"cons": [], "pros": []}}, {"hotel_id": "2751930", "review": {"cons": [], "pros": []}}, {"hotel_id": "2912243", "review": {"cons": [], "pros": []}}, {"hotel_id": "2912244", "review": {"cons": [], "pros": []}}, {"hotel_id": "3026434", "review": {"cons": [], "pros": []}}, {"hotel_id": "3041919", "review": {"cons": [], "pros": []}}, {"hotel_id": "3217195", "review": {"cons": [], "pros": []}}, {"hotel_id": "3555133", "review": {"cons": [], "pros": []}}, {"hotel_id": "3664307", "review": {"cons": [], "pros": []}}, {"hotel_id": "3693027", "review": {"cons": [], "pros": []}}, {"hotel_id": "3858104", "review": {"cons": [], "pros": []}}, {"hotel_id": "4000357", "review": {"cons": [], "pros": []}}, {"hotel_id": "4518699", "review": {"cons": [], "pros": []}}, {"hotel_id": "4607568", "review": {"cons": [], "pros": []}}, {"hotel_id": "4609378", "review": {"cons": [], "pros": []}}, {"hotel_id": "4746814", "review": {"cons": [], "pros": []}}, {"hotel_id": "4815420", "review": {"cons": [], "pros": []}}]